# # 집합 기초

# # ===========================================================
# #  집합 (set): 여러 객체를 순서 없이 중복을 허용하지 않고 저장하는 변경 가능한 자료형
# #  집합의 특징
# #  1. ( mutable,변경가능 )
# #  2. ( iterable, 반복가능 )
# #  3. ( seqence X, 인덱싱과 슬라이싱 불가 )
# #  4. ( 중복 허용 안함 )
# # ===========================================================

# # 집합 생성
# # a = {}    #딕셔너리
# a = set()
# print(type(a))

a = {3, 3, 3, 2, 2, 1, 1, 1}
print(a)

# b = {100,8,30}
# print(b)

# # ===========================================================
# # 1. 집합은 mutable하다. (변경 가능)
# # ===========================================================

# a.update({3,4})
# print(a)

# a.remove(3)
# print(a)

# a.pop()
# print(a)

# ===========================================================
# 2. 집합은 iterable하다. (반복 가능)
# ===========================================================

# 집합 순회
for i in a:
    print(i)


# ===========================================================
# 3. 집합은 sequence 객체가 아니다. (인덱싱, 슬라이싱 불가)
# ===========================================================

# a[0] = 10

# ===========================================================
# 4. 집합은 중복을 허용하지 않는다.
# ===========================================================

s = {10, 10, 10, 20, 20}
print(s)

# ===========================================================
#  파이썬 내장 함수
# ===========================================================

print(len(s))
print(sum(s))
print(min(s))
print(max(s))
print(sorted(s))


# 집합 합치기
s2 = {30, 40}
# print(a+s) +안됌
print(sorted(s.union(s2)))  # updat와 비슷하지만 새로운 객체를 만듬(updat는 원본 바꿈)


# 집합 반복하기
# print(s*2) 에초에 쓸모가 없어서 지원 안함

# 멤버십 연산자
print(10 in s)
print(1 in s)
